Merge pull request #10 from pranems/feat/customattrflag
upgrade tech stack to latest and refresh v0.10.0 ops docs and harden …
